app/Controllers/Admin.php

SELECT *
FROM `pelanggan_wifi`
---
    public function pelanggan()
    {
        $data = [
            'title' => 'Daftar Nama Pelanggan',

            'pelanggan' => $this->pelangganWifiModel->findAll(),

SELECT *
FROM `paket`
---
    public function paket()
    {
        $data = [
            'title' => 'Paket Wifi',
            'paket' => $this->paketModel->findAll(),

SELECT `paket`.*
FROM `paket`
---
    public function tambah_pelanggan()
    {
        $data = [
            'title' => 'Tambah Pelanggan',
            'barangList' => $this->paketModel
                ->select('paket.*')
                ->findAll(),

SELECT `tagihan`.*, `pelanggan_wifi`.`nama`, `pelanggan_wifi`.`alamat`, `pelanggan_wifi`.`no_hp`, `pelanggan_wifi`.`nik`, `paket`.`nama_paket`, `paket`.`harga`
FROM `tagihan`
LEFT JOIN `pelanggan_wifi` ON `tagihan`.`pelanggan_id` = `pelanggan_wifi`.`id`
LEFT JOIN `paket` ON `tagihan`.`kode_paket` = `paket`.`kode_paket`
---
    public function tagihan()
    {
        $tagihanModel = new tagihanModel();
        $query = $tagihanModel->builder()
            ->select('tagihan.*, pelanggan_wifi.nama, pelanggan_wifi.alamat, pelanggan_wifi.no_hp, pelanggan_wifi.nik, paket.nama_paket, paket.harga')
            ->join('pelanggan_wifi', 'tagihan.pelanggan_id = pelanggan_wifi.id', 'left')
            ->join('paket', 'tagihan.kode_paket = paket.kode_paket', 'left')
            ->get();