app/Controllers/Admin.php

    public function cetakTagihanById($id)
    {
        $tagihanModel = new tagihanModel();

        $query = $tagihanModel->builder()
            ->select('tagihan.*, pelanggan_wifi.nama, pelanggan_wifi.alamat, pelanggan_wifi.no_hp, pelanggan_wifi.nik, paket.nama_paket, paket.harga')
            ->join('pelanggan_wifi', 'tagihan.pelanggan_id = pelanggan_wifi.id', 'left')
            ->join('paket', 'tagihan.kode_paket = paket.kode_paket', 'left')
            ->where('tagihan.id', $id)
            ->get();

        $tagihanData = $query->getRowArray();
---
SELECT `tagihan`.*, `pelanggan_wifi`.`nama`, `pelanggan_wifi`.`alamat`, `pelanggan_wifi`.`no_hp`, `pelanggan_wifi`.`nik`, `paket`.`nama_paket`, `paket`.`harga`
FROM `tagihan`
LEFT JOIN `pelanggan_wifi` ON `tagihan`.`pelanggan_id` = `pelanggan_wifi`.`id`
LEFT JOIN `paket` ON `tagihan`.`kode_paket` = `paket`.`kode_paket`