app/Controllers/Administrator.php

    public function index()
    {
        $latestKas = $this->KasModel->orderBy('id_kas', 'DESC')->first();
        $saldoTerakhir = $latestKas ? $latestKas['saldo_terakhir'] : 0;

        $queryBarangStokDibawah10 = $this->db->table('barang')->where('stok <', 10)->get()->getResult();
        $stokdibawah10 = count($queryBarangStokDibawah10);

        $waktu24JamYangLalu = date('Y-m-d H:i:s', strtotime('-24 hours'));
        $totalPenjualan24Jam = $this->db->table('penjualan_barang')->where('tanggal_penjualan >=', $waktu24JamYangLalu)->countAllResults();

        // $totalKasMasuk = $this->db->table('kas_toko')
        // ->selectSum('jumlah_akhir')
        // ->where('jenis_transaksi', 'penerimaan')
        // ->get()
        // ->getRow()->jumlah_akhir;
        $totalKasMasuk = $this->db->table('kas_toko')
            ->select('SUM(jumlah_akhir - jumlah_awal) AS total_masuk', false)
            ->where('jenis_transaksi', 'penerimaan')
            ->get()
            ->getRow()->total_masuk;
        // $totalKasMasuk = $this->db->query("
        //     SELECT SUM(jumlah_akhir - jumlah_awal) AS total_masuk
        //     FROM kas_toko
        //     WHERE jenis_transaksi = 'penerimaan'
        // ")->getRow()->total_masuk;
        $totalKasKeluar = $this->db->table('kas_toko')
            ->select('SUM(jumlah_awal - jumlah_akhir) AS total_keluar', false)
            ->where('jenis_transaksi', 'pengeluaran')
            ->get()
            ->getRow()->total_keluar;
---
SELECT *
FROM `barang`
WHERE `stok` < 10
SELECT COUNT(*) AS `numrows`
FROM `penjualan_barang`
WHERE `tanggal_penjualan` >= '2024-09-14 12:36:29'
SELECT SUM(jumlah_akhir - jumlah_awal) AS total_masuk
FROM `kas_toko`
WHERE `jenis_transaksi` = 'penerimaan'
SELECT SUM(jumlah_awal - jumlah_akhir) AS total_keluar
FROM `kas_toko`
WHERE `jenis_transaksi` = 'pengeluaran'