app/Controllers/Admin.php

    public function index()
    {
        $latestKas = $this->KasModel->orderBy('id_kas', 'DESC')->first();
        $saldoTerakhir = $latestKas ? $latestKas['saldo_terakhir'] : 0;

        $queryBarangStokDibawah10 = $this->db->table('barang')->where('stok <', 10)->get()->getResult();
        $stokdibawah10 = count($queryBarangStokDibawah10);

        $waktu24JamYangLalu = date('Y-m-d H:i:s', strtotime('-24 hours'));
        $totalPenjualan24Jam = $this->db->table('penjualan_barang')->where('tanggal_penjualan >=', $waktu24JamYangLalu)->countAllResults();

        // $totalKasMasuk = $this->db->table('kas_toko')
        // ->selectSum('jumlah_akhir')
        // ->where('jenis_transaksi', 'penerimaan')
        // ->get()
        // ->getRow()->jumlah_akhir;
        $totalKasMasuk = $this->db->table('kas_toko')
            ->select('SUM(jumlah_akhir - jumlah_awal) AS total_masuk', false)
            ->where('jenis_transaksi', 'penerimaan')
            ->get()
            ->getRow()->total_masuk;
        // $totalKasMasuk = $this->db->query("
        //     SELECT SUM(jumlah_akhir - jumlah_awal) AS total_masuk
        //     FROM kas_toko
        //     WHERE jenis_transaksi = 'penerimaan'
        // ")->getRow()->total_masuk;
        $totalKasKeluar = $this->db->table('kas_toko')
            ->select('SUM(jumlah_awal - jumlah_akhir) AS total_keluar', false)
            ->where('jenis_transaksi', 'pengeluaran')
            ->get()
            ->getRow()->total_keluar;
---
SELECT *
FROM `barang`
WHERE `stok` < 10
SELECT COUNT(*) AS `numrows`
FROM `penjualan_barang`
WHERE `tanggal_penjualan` >= '2024-11-25 16:28:05'
SELECT SUM(jumlah_akhir) - SUM(jumlah_awal) AS total_masuk
FROM `kas_toko`
WHERE `jenis_transaksi` = 'penerimaan'
SELECT SUM(ABS(jumlah_awal - jumlah_akhir)) AS total_keluar
FROM `kas_toko`
WHERE `jenis_transaksi` = 'pengeluaran'

    public function profil()
    {
        $data['title'] = 'User Profile ';
        $userlogin = user()->username;
        $userid = user()->id;
        $role = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
        $role == '1' ? $role_echo = 'Admin' : $role_echo = 'Pegawai'; // $data['title'] = 'User Profile ';
        $userlogin = user()->username;
        $userid = user()->id;

        // Mengambil data role dari tabel auth_groups_users
        $roleData = $this->db->table('auth_groups_users')->where('user_id', $userid)->get()->getRow();
---
SELECT *
FROM `auth_groups_users`
WHERE `user_id` = '1'

    public function pelanggan()
    {
        $data = [
            'title' => 'Daftar Nama Pelanggan',

            'pelanggan' => $this->pelangganWifiModel

                ->select('pelanggan_wifi.*, paket.nama_paket, paket.harga')  // Selecting fields you want
                ->join('paket', 'paket.kode_paket = pelanggan_wifi.kode_paket', 'left')  // Perform LEFT JOIN
                ->findAll(),
---
SELECT `pelanggan_wifi`.*, `paket`.`nama_paket`, `paket`.`harga`
FROM `pelanggan_wifi`
LEFT JOIN `paket` ON `paket`.`kode_paket` = `pelanggan_wifi`.`kode_paket`

    public function pelanggan_edit($id)
    {
        $data = [
            'title' => 'Ubah Pelanggan',
            'validation' => $this->validation,
            'pelanggan' => $this->pelangganWifiModel->find($id),
---
SELECT *
FROM `pelanggan_wifi`
WHERE `pelanggan_wifi`.`id` = '12'

    public function cetakLabaRugi()
    {
        $tanggalMulai = $this->request->getPost('tanggal_mulai');
        $tanggalAkhir = $this->request->getPost('tanggal_akhir');

        // Validasi input
        if (!$tanggalMulai || !$tanggalAkhir) {
            return redirect()->back()->with('error', 'Tanggal mulai dan akhir harus diisi.');
        }

        // Query untuk mendapatkan data penjualan bersih dari model PenjualanBarangModel
        $penjualanModel = new PenjualanBarangModel();
        $totalPenjualan = $penjualanModel
            ->selectSum('total_penjualan')
            ->where('tanggal_penjualan >=', $tanggalMulai)
            ->where('tanggal_penjualan <=', $tanggalAkhir)
            ->first()['total_penjualan'];
---
SELECT SUM(`total_penjualan`) AS `total_penjualan`
FROM `penjualan_barang`
WHERE `tanggal_penjualan` >= '2024-11-28'
AND `tanggal_penjualan` <= '2024-11-28'
 LIMIT 1

        $builder->select('users.fullname');
        $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $builder->where('auth_groups_users.group_id', 3);
        $query = $builder->get();
---
SELECT *
FROM `auth_groups`

    public function cetakTagihanById($id)
    {
        $tagihanModel = new tagihanModel();

        $query = $tagihanModel->builder()
            ->select('tagihan.*, pelanggan_wifi.nama, pelanggan_wifi.alamat, pelanggan_wifi.no_hp, pelanggan_wifi.nik, paket.nama_paket, paket.harga')
            ->join('pelanggan_wifi', 'tagihan.pelanggan_id = pelanggan_wifi.id', 'left')
            ->join('paket', 'tagihan.kode_paket = paket.kode_paket', 'left')
            ->where('tagihan.id', $id)
            ->get();

        $tagihanData = $query->getRowArray();
---
SELECT `tagihan`.*, `pelanggan_wifi`.`nama`, `pelanggan_wifi`.`alamat`, `pelanggan_wifi`.`no_hp`, `pelanggan_wifi`.`nik`, `paket`.`nama_paket`, `paket`.`harga`
FROM `tagihan`
LEFT JOIN `pelanggan_wifi` ON `tagihan`.`pelanggan_id` = `pelanggan_wifi`.`id`
LEFT JOIN `paket` ON `tagihan`.`kode_paket` = `paket`.`kode_paket`
WHERE `tagihan`.`id` = '8'
SELECT `tagihan`.*, `pelanggan_wifi`.`nama`, `pelanggan_wifi`.`alamat`, `pelanggan_wifi`.`no_hp`, `pelanggan_wifi`.`nik`, `paket`.`nama_paket`, `paket`.`harga`
FROM `tagihan`
LEFT JOIN `pelanggan_wifi` ON `tagihan`.`pelanggan_id` = `pelanggan_wifi`.`id`
LEFT JOIN `paket` ON `tagihan`.`kode_paket` = `paket`.`kode_paket`

    public function tagihanbelumbayar()
    {
        // Membuat instance model tagihan
        $tagihanModel = new tagihanModel();

        // Ambil data tagihan dengan status "Belum Dibayar" dan join dengan tabel pelanggan dan paket
        $query = $tagihanModel->builder()
            ->select('tagihan.*, pelanggan_wifi.nama, pelanggan_wifi.alamat, pelanggan_wifi.no_hp, pelanggan_wifi.nik, paket.nama_paket, paket.harga')
            ->join('pelanggan_wifi', 'tagihan.pelanggan_id = pelanggan_wifi.id', 'left')
            ->join('paket', 'tagihan.kode_paket = paket.kode_paket', 'left')
            ->where('tagihan.status_tagihan', 'Belum Dibayar') // Tambahkan kondisi status "Belum Dibayar"
            ->get(); // Ambil semua tagihan dengan status "Belum Dibayar"

        // Ambil data tagihan terbaru
        $tagihanData = $query->getResultArray();
---
SELECT *
FROM `tagihan`
WHERE `pelanggan_id` = '11'
AND `kode_paket` = 'PKG8971'
AND `status_tagihan` = 'Belum Dibayar'
 LIMIT 1