app/Models/pelangganWifiModel.php

    public function countPelangganAktif()
    {
        return $this->where('status_pelanggan', 'aktif')
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pelanggan_wifi`
WHERE `status_pelanggan` = 'aktif'

    public function countPelangganByStatus()
    {
        $this->select('status_pelanggan, COUNT(*) AS total')
             ->groupBy('status_pelanggan');
        return $this->get()->getResult();
---
SELECT `status_pelanggan`, COUNT(*) AS total
FROM `pelanggan_wifi`
GROUP BY `status_pelanggan`