app/Models/PenjualanBarangModel.php

    public function getAllSales()
    {
        return $this->orderBy('tanggal_penjualan', 'ASC')->findAll();
---
SELECT *
FROM `penjualan_barang`
ORDER BY `tanggal_penjualan` ASC